app/views/devise/registrations/new.html.erb

SELECT "laboratories".* FROM "laboratories"
---
      <div class="form-group">
        <%= f.collection_select :laboratory_id, Laboratory.all, :id, :name, {}, class: "form-control"%>