app/controllers/api/v1/pharmacies_controller.rb

  def index
    render :json => Pharmacy.all
---
SELECT "pharmacies".* FROM "pharmacies"