app/controllers/api/v1/registrations_controller.rb

  def create
    user = User.new(user_paramssignin)
    if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "first_name", "last_name", "role", "laboratory_id", "authentication_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"