app/controllers/api/v1/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "meme@meme"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(:email => params[:user_login].downcase)