app/views/dashboards/campaigns_past.html.erb

        <% @campaigns.each do |campaign| %>
          <% if ((arr.include?(campaign.campaign_number) == false)) && campaign.end_at.to_date.past? %>
---
SELECT "campaigns".* FROM "campaigns"