app/views/dashboards/campaigns_current.html.erb

        <% @campaigns.each do |campaign| %>
          <% if ((arr.include?(campaign.campaign_number) == false)) && ((campaign.start_at.today? || campaign.start_at.to_date.past?) && campaign.end_at.to_date.future?) %>
---
SELECT "campaigns".* FROM "campaigns"

                <td><%= campaign.target %></td>
                <td><%= Campaign.where(campaign_number: campaign.campaign_number).count %></td>
---
SELECT COUNT(*) FROM "campaigns" WHERE "campaigns"."campaign_number" = $1  [["campaign_number", "2017070001"]]