app/controllers/campaigns_controller.rb

    def index
      # @campaigns = Campaign.all
      p 'index '*10
      p session[:nbr_campaign]
      # path = Campaign.where(campaign_number: session[:nbr_campaign])
      @campaigns = Campaign.where(campaign_number: session[:nbr_campaign])
      respond_to do |format|
        format.html
        format.xlsx {
          response.headers['Content-Disposition'] = 'attachment; filename="all_products.xlsx"'
        }
      end
      @campaign = @campaigns.first
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."campaign_number" = $1 ORDER BY "campaigns"."id" ASC LIMIT $2  [["campaign_number", "2017070001"], ["LIMIT", 1]]
SELECT "campaigns".* FROM "campaigns"

    def show
      p params
      @campaign = Campaign.find(params[:id])
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def import
      p params[:product]
      Campaign.import(params[:file], Pharmacy.all, params[:title], params[:product], params[:start_at], params[:end_at], params[:target], params[:laboratory_id])
---
SELECT  "campaigns".* FROM "campaigns" ORDER BY "campaigns"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "pharmacies".* FROM "pharmacies"