app/controllers/dashboards_controller.rb

SELECT "campaigns".* FROM "campaigns"
---
  def campaigns_current
    @campaigns = Campaign.all

SELECT "campaigns".* FROM "campaigns"
---
  def campaigns_past
    @campaigns = Campaign.all

SELECT "campaigns".* FROM "campaigns"
---
  def campaigns_futur
    @campaigns = Campaign.all