app/controllers/entries_controller.rb

SELECT "campaigns".* FROM "campaigns"
SELECT "entries".* FROM "entries"
---
    def new
      @campaigns = Campaign.all
      @now = @campaigns.where("end_at >= ?", Time.zone.now.beginning_of_day)
      if @now === []
        redirect_to root_url, :flash => { :error => "Aucune campagne en cour ou à venir." }
      end
      @entries = Entry.all

INSERT INTO "entries" ("type", "title", "product_concerned", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["type", "t"], ["title", "sdfvsfdgcfvas"], ["product_concerned", "2017070001 TG ifkdna"], ["created_at", "2017-07-11 18:56:55.842936"], ["updated_at", "2017-07-11 18:56:55.842936"]]
---
    def create
      @entry = Entry.new(entry_params)
        if @entry.save