app/views/campaigns/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          <% elsif @campaign.statut_type === 'validate' %>
            <span>Validé par <%= @campaign.user.first_name %> <%= @campaign.user.last_name %></span>